11/data/attachments/a562b9a81400e846.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9c581f7f-539e-4ef5-9729-453a7ac2136f</nif:username>
            <nif:friendToBeAdded>Katherine_home_Actions_8041_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>